[{"title":"NDA Pune Group C Various Post Online Form 2024","url":"https://www.sarkariresult.com/2024/nda-pune-group-c/","name of post":"nda pune group c recruitment 2024 apply online for various 198 post","post date / update":"27 january 2024 | 11:50 pm","short information ":"national defence academy, pune has relased group c ldc, multi tasking staff mts, driver and other various iti and non iti post recruitment 2024. those candidates who are interested in this nda pune recruitment can apply online from 27 january 2024 to 16 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 27/01/2024","Last Date for Apply Online ":"16/02/2024 (21 Days)","Last Date Pay Exam Fee ":" 16/02/2024","Exam Date ":" as per Schedule","Admit Card Available ":" Notified Soon","General / Other State ":" 0/-","OBC / BC ":" 0/-","SC / ST ":" 0/-","No Application Fee for the All Candidates Only Registered Online.":"","Minimum Age ":" 18 Years","Maximum Age ":" 25 Years for All Other Post","Age Relaxation Extra as per National Defence Academy, Pune Group C Various Post Exam 2024 Recruitment Rules.":""},{"title":"RPSC Programmer Online Form 2024","url":"https://www.sarkariresult.com/rpsc/rpsc-programmer-13-2023-jan24/","name of post":"rajasthan rpsc programmer recruitment 2024 apply online for 216 post","post date / update":"26 january 2024 | 09:34 pm","short information ":"rajasthan public service commission (rpsc) has released the advertisement of programmer recruitment 2024. those candidates are interested with vacancy can apply online from 01/02/2024 to 01/03/2024. for other information related to rajasthan programmer 2024 recruitment like syllabus, age limit, qualification, pay scale and all other information read the advertisement and then apply.","Application Begin ":" 01/02/2024","Last Date for Apply Online ":" 01/03/2024","Last Date Pay Exam Fee ":" 01/03/2024","Exam Date ":" as per Schedule","Admit Card Available ":" Notified Soon","General / Other State ":" 600/-","OBC / BC ":" 400/-","SC / ST ":" 400/-","Correction Charge ":" 500/-","Pay the Exam Fee Through Cash at Rajasthan E Mitra Portal or Through Debit Card, Credit Card, Net Banking":"","From 19 April 2023 onwards only one time fee will be charged for all the exams of Rajasthan":"","Minimum Age ":" 21 Years","Maximum Age ":" 40 Years","Age Relaxation Extra as per Rajasthan Public Service Commission RPSC Programmer Exam 2024 Recruitment Rules.":""},{"title":"Army SSC Tech 63 Men / 34 Women Entry Online Form 2024","url":"https://www.sarkariresult.com/force/army-ssc-tech-63men-34women/","name of post":"join indian army ssc tech entry 63 men / 34 women october 2024 batch recruitment apply online for 379 post","post date / update":"26 january 2024 | 09:16 pm","short information ":"join indian army has relased j63 ssc men and 34 ssc women entry october 2024 batch. those candidates who are interested in this army short service commission ssc tech entry october 2024 batch recruitment can apply online from 23 january 2024 to 21 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 23/01/2024","Last Date for Apply Online ":"  21/02/2024 upto 03 PM only","Last Date Complete Form ":" 21/02/2024","Course Start ":" As per Schedule","General / OBC ":" 0/-","SC / ST / Female ":" 0/-","No Application Fee for the All Candidates Only Fill the Online Application Form":"","Minimum Age ":" 20 Years.","Maximum Age ":" 27 Years.","Age Relaxation as per Indian Army SSC Technical Entry October 2024 Recruitment Rules.":""},{"title":"JSSC Paramedical Post JPMCCE Online Form 2024","url":"https://www.sarkariresult.com/jharkhand/jssc-jpmcce-2023/","name of post":"jharkhand jssc pharmacist, nurse, x ray, laboratory experimental recruitment jpmcce 2023 apply online for 2485 post","post date / update":"26 january 2024 | 12:58 pm","short information ":"jharkhand staff selection commission (jssc)has released the jharkhand paramedical combined competitive examination jpmcce 2023 recruitment advertisement for 2485 posts. those candidates who are interested in this jssc jharkhand pharmacist, nurse, x ray, laboratory experimental recruitment can apply online from 22 january 2024 to 22 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 22/01/2024","Last Date for Apply Online ":" 22/02/2024","Last Date Pay Exam Fee ":" 22/02/2024","Correction Date ":" 01-03 March 2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 100/-","SC / ST ":" 50/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 38 Years for Female","Age Relaxation Extra as per JSSC Jharkhand Paramedical Combined Competitive Examination JPMCCE -2023 Recruitment Rules.":""},{"title":"RPSC School Lecturer (Sanskrit Education Department) Online Form 2024","url":"https://www.sarkariresult.com/rpsc/rpsc-school-lecturer-12-2023-jan24/","name of post":"rajasthan rpsc school lecturer (sanskrit education department) recruitment 2024 apply online for 52 post","post date / update":"26 january 2024 | 11:58 am","short information ":"rajasthan public service commission (rpsc) has released the advertisement of school lecturer pgt teacher (sanskrit education department) recruitment 2024. those candidates are interested with vacancy can apply online from 31/01/2024 to 29/02/2024. for other information related to school lecturer pgt teacher 2024 recruitment like syllabus, age limit, qualification, pay scale and all other information read the advertisement and then apply.","Application Begin ":" 31/01/2024","Last Date for Apply Online ":" 29/02/2024","Last Date Pay Exam Fee ":" 29/02/2024","Exam Date":" As per Schedule","Admit Card Available ":" Before Exam","General / Other State ":" 600/-","EWS / OBC / BC ":" 400/-","SC / ST ":" 400/-","Pay the Exam Fee Through Cash at Rajasthan E Mitra Portal or Through Debit Card, Credit Card, Net Banking.":"","If you have already paid the one time registration OTR fee then you do not need to pay again.":"","Minimum Age ":" 21 Years.","Maximum Age ":" 40 Years.","Age Relaxation Extra as per RPSC School Lecturer PGT Sanskrit Education Department Recruitment 2024.":""},{"title":"NTA Uttarakhand High Court Junior Assistant / Stenographer Online Form 2024","url":"https://www.sarkariresult.com/2024/nta-uttarakhand-high-court-jan24/","name of post":"nta uttarakhand high court ukhc junior assistant and stenographer recruitment 2024 apply online for 139 post","post date / update":"25 january 2024 | 01:15 pm","short information ":"national testing agency and high court of uttarakhand has relased junior assistant and stenographer recruitment 2024. those candidates who are interested in this ukhc junior assistant and stenographer recruitment can apply online from 25 january 2024 to 22 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 25/01/2024","Last Date for Apply Online ":" 22/02/2024 upto 5PM","Pay Exam Fee Last Date ":" 23/02/2024","Exam Date ":" 17/03/2024","Admit Card Available ":" Before Exam","Gen (UR)  / OBC ":" 1000/-","EWS ":" 500/-","SC / ST ":" 500/-","Pay the Exam Fee Through Debit Card, Credit Card, Net Banking Only.":"","Minimum Age ":" 21 Years","Maximum Age ":" 35 Years","Age Relaxation Extra as per NTA Uttarakhand High Court, Nainital Junior Assistant and Stenographer Recruitment Rules.":""},{"title":"MPPSC Pre 2024 Online Form","url":"https://www.sarkariresult.com/mp/mppsc-pre-2024/","name of post":"mppsc state service / state forest recruitment 2024 apply online for 74 post","post date / update":"25 january 2024 | 12:27 pm","short information ":"madhya pradesh public service commission mppsc has relased state service exam sse and state forest exam sfe advt no. 40/2023 and 41/2023 recruitment 2024. those candidates who are interested in this mppsc pre recruitment can apply online from 19 january 2024 to 18 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 19/01/2024","Last Date for Apply Online ":" 18/02/2024 Upto 12 Noon","Pay Exam Fee Last Date ":" 18/02/2024","Last Date Correction ":" 22/02/2024","Exam Date Pre ":" 28/04/2024","Admit Card Available ":" Before Exam","General / Other State ":" 500/-","MP Reserve Category ":" 250/-","Portal Charge ":" 40/- (Extra)","Correction Charge ":" 50/-","Pay the Examination Fee Through Cash at MP Online Kiosk or Debit Card, Credit Card, Net Banking Fee Mode Only":"","Minimum Age ":" 21 Years.","Maximum Age ":" 40 Years. for Other Post","Age Relaxation Extra as per MPPSC State Service Exam SSE Pre & State Forest Exam SFE 2024 Exam Rules.":""},{"title":"Chandigarh JBT Teacher Online Form 2024","url":"https://www.sarkariresult.com/2024/chandigarh-jbt-teacher-06-2023/","name of post":"chandigarh junior basic training jbts teacher recruitment 2024 apply online for 396 post","post date / update":"24 january 2024 | 12:19 pm","short information ":"education department, chandigarh administration has relased junior basic training jbts teacher advt no. 06/2023 recruitment 2024. those candidates who are interested in this chandigarh jbt teacher recruitment can apply online from 24 january 2024 to 19 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 24/01/2024","Last Date for Apply Online ":" 19/02/2024 upto 05 PM Only","Pay Examination Fee Last Date ":" 22/02/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 1000/-","SC ":" 500/-","Pay the Examination Fee Through Debit Card / Credit Card / Net Banking Fees Mode. OR Pay the Fees Through Offline E Challan.":"","Minimum Age ":"  21 Years.","Maximum Age ":" 37 Years.","Age Relaxation Extra as per Chandigarh Junior Basic Training JBT Teacher 2023-2024 Recruitment Rules.":""},{"title":"Chandigarh Police Constable Executive IT Online Form 2024","url":"https://www.sarkariresult.com/2024/chandigarh-constable-it-jan24/","name of post":"chandigarh police chd constable executive it recruitment 2024 apply online for 144 post","post date / update":"23 january 2024 | 07:26 pm","short information ":"chandigarh police has relased constable executive it recruitment 2024. those candidates who are interested in this chandigarh police constable it recruitment can apply online from 23 january 2024 to 13 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 23/01/2024","Last Date for Apply Online ":" 13/02/2024","Pay Examination Fee ":" 13/02/2024","Exam Date":"  03/03/2024","Admit Card Available ":" Before Exam","General / OBC ":" 1000/-","SC / EWS":" 800/-","Payment Mode - Pay the Examination Fee Through Debit Card / Credit Card / Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 25 Years.","Age Relaxation Extra as per Chandigarh Police Constables (Executive IT) Recruitment Rules 2024.":""},{"title":"Delhi Home Guard Online Form 2024","url":"https://www.sarkariresult.com/delhi/delhi-home-guards-jan24/","name of post":"dghg delhi home guards recruitment 2024 apply online for 10285 post","post date / update":"23 january 2024 | 06:03 pm","short information ":"directorate general of home guards dghg, delhi has relased assistant home guards recruitment 2024. those candidates who are interested in this delhi home guards recruitment can apply online from 24 january 2024 to 13 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 24/01/2024","Last Date for Apply Online ":" 13/02/2024","Pay Exam Fee Last Date ":" 13/02/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","Gen / OBC / EWS ":" 100/-","SC / ST ":" 100/-","Pay the Exam Fee Through Debit Card, Credit Card, Net Banking Only.":"","Minimum Age ":" 20 Years.","Maximum Age ":" 45 Years","Age Relaxation Extra as per Delhi National Capital Territory of Delhi / Directorate General of Home Guards  Recruitment Rules.":""},{"title":"Rajasthan High Court JPA Hindi Online Form 2024","url":"https://www.sarkariresult.com/rpsc/rajasthan-hc-jpa-hindi-feb24/","name of post":"rajasthan high court rhc junior personal assistant hindi recruitment 2024 apply online for 30 post","post date / update":"20 january 2024 | 11:26 am","short information ":"rajasthan high court, rhc jodhpur has released the notification for recruitment to 30 posts of junior personal assistant hindi 2024 . any candidate who is interested in this rajasthan high court jpa hindi recruitment and fulfills the eligibility can apply online from 09 february 2024 to 09 march 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":"  09/02/2024","Last Date for  Apply Online ":" 09/03/2024","Pay Exam Fee Last Date ":" 10/03/2024","Exam Date CBT ":" As per Schedule","Admit Card Available ":" Before Exam","General / Other State ":" 750/-","OBC / EWS ":" 600/-","SC / ST / PH ":" 450/-","Pay the Exam Fee Through Debit Card, Credit Card, Net Banking or Pay the Exam Fee Through Offline Payment  E Challan Fee Mode":"","Minimum Age ":" 18 Years.","Maximum Age ":" 40 Years.","Age Relaxation As per Rajasthan High Court Junior Personal Assistant JPA Hindi Recruitment Rules.":""},{"title":"RSMSSB Animal Attendant Online Form 2024","url":"https://www.sarkariresult.com/rpsc/rsmssb-animal-07-2023/","name of post":"rajasthan rsmssb animal attendant recruitment 2024 apply online for 5934 post","post date / update":"19 january 2024 | 05:38 pm","short information ":"rajasthan staff selection board rsmssb has released the advertisement of animal attendant (pashu parichar) post 2023. those candidates who are interested in this rsmssb animal attendant advt no. 07/2023 fulfill the eligibility can apply online from 19/01/2024 to 17/02/2024. for other information related to recruitment like syllabus, age limit, qualification, pay scale and all other information read the advertisement and then apply.","Application Begin ":" 19/01/2024","Last Date for Apply Online ":" 17/02/2024","Pay Exam Fee Last Date ":" 17/02/2024","Exam Date ":" April to June 2024 (Tentative)","Admit Card Available ":" Before Exam","General / OBC ":" 600/-","OBC NCL ":" 400/-","SC / ST ":" 400/-","Correction Charge ":" 300/-","This fee is for one time registration, now after paying the OTR fee once, the candidate will not have to pay the application fee again and again.":"","Pay the Exam Fee Through Emitra CSC Center, Debit Card, Credit Card, Net Banking.":"","Minimum Age ":" 18 Years","Maximum Age ":" 40 Years","Age Relaxation Extra as per RSSB Animal Attendant Pashu Parichar Exam 2023 Recruitment Rules.":""},{"title":"Railway RRB Assistant Loco Pilot ALP Online Form 2024","url":"https://www.sarkariresult.com/railway/rrb-alp-cen-01-2024/","name of post":"railway recruitment board rrb assistant loco pilot alp cen 01/2024 apply online for 5696 post","post date / update":"26 january 2024 | 09:11 pm","short information ":"indian railway (railway recruitment board) has relased assistant loco pilot alp recruitment 2024. those candidates who are interested in this rrb prayagraj, rrb gorakhpur, rrb ajmer, rrb kolkata, rrb mumbai, rrb secunderabad, rrb chennai and other recruitment can apply online from 20 january 2024 to 19 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 20/01/2024","Last Date for Apply Online ":" 19/02/2024","Last Date Pay Exam Fee ":" 19/02/2024","Correction / Modified Form ":" 20-29 February 2024","Exam Date ":" As per Schedule","Admit Card Available ":" Notified Soon ","General / OBC / EWS ":" 500/-","EBC ":" 250/-","All Category Female ":" 250/-","After Appear the Stage I Exam":"","General / OBC / EWSFee Refund ":" 400/-","SC / ST / EBC / Female Refund ":" 250/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years","Maximum Age ":" 30 Years.","Age Relaxation Extra as per Railway Recruitment Board RRB ALP Recruitment Advt No. CEN 01/2024 Vacancy Rules.":""},{"title":"BSSC 2nd Inter Level Edit Form / Document Upload","url":"https://www.sarkariresult.com/bihar/bssc-inter-level-02-2023/","name of post":"bihar ssc 2nd inter level 10+2 recruitment 2023 edit form / upload document (all candidate) 2024 for 12199 various post","post date / update":"19 january 2024 | 11:17 am","short information ":"bihar staff selection commission (bssc) has released the 2nd inter level combined competitive examination notification for the recruitment of 12199 various inter level post 2023. those candidates are enrolled with vacancy can uploaded documents. see the advertisement for information related to age limit, syllabus, state wise post, selection procedure, pay scale in bssc inter level recruitment 2023.","Application Begin ":" 27/09/2023","Last Date for Apply Online ":" 09/12/2023","Pay Exam Fee  Last Date ":" 09/12/2023","Complete Form Last Date ":" 11/12/2023","Edit Form / Upload Document ":" 18/01/2024 to 18/02/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam    ","General / OBC / EWS ":" 540/-","SC / ST ":" 135/-","Female Candidate (Bihar Domicile) ":" 135/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking, E Challan":"","Minimum Age  ":" 18 Years","Maximum Age  ":" 37 Years for Male","Maximum Age ":" 40 Years for Female","Age Relaxation Extra as per Bihar SSC 2nd Inter Level Combined Competitive Examination  Recruitment 2023 Rules.":""},{"title":"DSSSB TGT, Drawing Teacher Online Form 2024","url":"https://www.sarkariresult.com/delhi/dsssb-tgt-drawing-02-2024/","name of post":"delhi dsssb trained graduate teacher tgt and drawing recruitment 2024 apply online 5118 post for under advt no. 02/2024","post date / update":"18 january 2024 | 01:45 pm","short information ":"dsssb assistant teacher nursery online form 2024 delhi subordinate services selection board dsssb has released the advertisement for recruitment to 5118 posts of trained graduate teacher tgt and drawing teacher recruitment 2024. any candidate who wants to apply for the post of dsssb tgt whose advertisement number is 02/2024 can apply online and pay the fee between 08 february 2024 to 08 march 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":"08/02/2024","Last Date for Apply Online ":" 08/03/2024","Last Date Pay Exam Fee ":" 08/03/2024","Exam Date ":" As per Schedule   ","Admit Card Available ":" Notified Soon ","General / OBC / EWS ":" 100/-","SC / ST / PH ":" 0/-","All Category Female ":" 0/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years","Maximum Age ":" 32 Years.","Age Relaxation Extra as per DSSSB Trained Graduate Teacher TGT and Drawing Teacher Recruitment Advt No. 02/2024 Vacancy Rules.":""},{"title":"UP Police Constable Edit / Correction Form 2024","url":"https://www.sarkariresult.com/2023/up-police-constable-dec23/","name of post":"uttar pradesh up police constable recruitment 2023 apply online for 60244 male / female post 2024","post date / update":"17 january 2024 | 10:17 am","short information ":"uttar pradesh police recruitment & promotion board (upprpb) has released the advertisement for recruitment under constable in which there are a total of 60244 posts. both male and female candidates can apply online from 27 december 2023 to 16 january 2024. see the advertisement for information related to age limit, syllabus, age relaxation, selection procedure, pay scale in upp constable civil police recruitment 2023.","Notification Released ":" 23/12/2023","Application Begin ":" 27/12/2023","Last Date for Apply Online ":" 16/01/2024","Pay Exam Fee Last Date ":" 16/01/2024","Upload Document / Correction Last Date ":" 17-20 January 2024","Exam Date ":" February 2024","Admit Card Available ":" Before Exam","General / OBC ":" 400/-","SC / ST ":" 400/-","Pay the Exam Fee Through Online Fee Mode Debit Card, Credit Card, Net Banking or Offline E Challan Mode":"","Minimum Age ":" 18 Years","Maximum Age ":" 28 Years for Female","Age Relaxation Extra as per UPP Constable Recruitment 2023 Rules.":""},{"title":"BPSC Agriculture Various Post Online Form 2024","url":"https://www.sarkariresult.com/bihar/bpsc-agriculture-advt-18-21-2024/","name of post":"bpsc agriculture department various post recruitment 2024 apply online for 150 1051","post date / update":"18 january 2024 | 07:49 pm","short information ":"bihar public service commission has relased various post in bihar agriculture services and bihar agriculture subordiante services recruitment 2024. those candidates who are interested in this bihar agriculture department recruitment can apply online from 15 january 2024 to 28 january 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 15/01/2024","Last Date for Apply Online ":" 28/01/2024","Pay Exam Fee Last Date ":" 28/01/2024","Exam Date ":"As per Schedule","Admit Card Available ":" Before Exam","General / OBC/ Other State ":" 750/-","SC / ST / PH ":" 200/-","Female Candidate (Bihar Dom.) ":" 200/-","Pay the Exam Fee Through Online / Offline Fee Mode Only":"","Minimum Age ":" 21 Years","Maximum Age ":" 40 Years for Female","Read the Notification for Age Relaxation in BPSC Agriculture Department Various Post Recruitment 2024.":""},{"title":"NCL CIL Assistant Foreman Online Form 2024","url":"https://www.sarkariresult.com/2024/nclcil-asst-foreman-jan24/","name of post":"northern coalfield limited nclcil assistant foreman recruitment 2024 apply online for 150 post","post date / update":"15 january 2024 | 03:15 pm","short information ":"northern coalfield limited nclcil has relased assistant foreman trainee recruitment 2024. those candidates who are interested in this ncl cil assistant foreman trainee recruitment can apply online from 15 january 2024 to 05 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 15/01/2024","Last Date for Apply Online ":" 05/02/2024","Pay the Exam Last Date ":" 05/02/2024","Exam Date":"  As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 1180/-","SC / ST / PH ":" 0/-","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 30 Years.","Age Relaxation As per Northern Coal Field NCL Assistant Foreman Trainee 2024 Recruitment Rules.":""},{"title":"Jharkhand JSSC Constable Online Form 2024","url":"https://www.sarkariresult.com/jharkhand/jssc-constable-jcce2023/","name of post":"jharkhand police jssc constable recruitment 2023 apply online for 4919 post","post date / update":"23 january 2024 | 11:06 am","short information ":"jharkhand staff selection commission (jssc)has released the jharkhand police constable competitive exam jcce 2023 recruitment advertisement for 4919 posts. those candidates who are interested in this jssc jharkhand constable (sipahi) recruitment can apply online from 22 january 2024 to 21 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 22/01/2024","Last Date for Apply Online ":" 21/02/2024","Last Date Pay Exam Fee ":" 23/02/2024","Upload Photo / Sign Last Date ":" 25/02/2024","Correction Date ":" 26-28 February 2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 100/-","SC / ST ":" 50/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 25 Years.","Age Relaxation Extra as per JSSC Constable Competitive Examination-2023 (Regular & Backlog) JCCE 2023 Recruitment Rules.":""},{"title":"Allahabad High Court HJS Online Form 2024","url":"https://www.sarkariresult.com/2023/allahabad-hc-hjs-2023/","name of post":"allahabad high court district judge up hjs recruitment 2023-24 apply online for 83 post","post date / update":"15 january 2024 | 11:58 am","short information ":"high court of judicature at allahabad, uttar pradesh has released the notification of district judge recruitment 2023. many people also know this recruitment by the name of up hjs. this year there are a total of 83 posts in uttar pradesh allahabad high court hjs recruitment for which online applications will run from 15 february 2024 to 31 march 2024. see the advertisement for information related to age limit, syllabus, selection procedure, pay scale in up hjs exam 2024.","Application Begin ":" 15/02/2024","Last Date for Apply Online ":" 31/03/2024","Last Date Pay Exam Fee ":"  31/03/2024","Submit Hard Copy Last Date ":" As per Schedule","Pre Exam Held on ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 1400/-","SC / ST ":" 1200/-","PH Divyang Gen / OBC / EWS ":" 750/-","PH Divyang SC / ST  ":" 500/-","Pay the Exam Fee Through Offline E Challan Fee Mode Only. Candidate Can Print Challan and Submit Fee Before Apply Online.":"","Minimum Age ":" 35 Years.","Maximum Age ":" 45 Years.","Age Relaxation Extra as per High Court of Judicature at Allahabad Higher Judicial Services Exam 2023-2024 Rules.":""},{"title":"DSSSB SPA, PA, JJA Online Form 2024","url":"https://www.sarkariresult.com/delhi/dsssb-spa-pa-jja-01-2024/","name of post":"delhi dsssb senior personal assistant, personal assistant & junior judicial assistant recruitment 2024 apply online 990 post for under advt no. 01/2024","post date / update":"18 january 2024 | 12:48 pm","short information ":"dsssb assistant teacher nursery online form 2024 delhi subordinate services selection board dsssb has released the advertisement for recruitment to 990 posts of senior personal assistant, personal assistant & junior judicial assistant recruitment 2024. any candidate who wants to apply for the post of dsssb spa, pa and jja whose advertisement number is 01/2024 can apply online and pay the fee between 18 january 2024 to 08 february 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":"18/01/2024","Last Date for Apply Online ":" 08/02/2024","Last Date Pay Exam Fee ":" 08/02/2024","Exam Date ":" As per Schedule   ","Admit Card Available ":" Notified Soon ","General / OBC / EWS ":" 100/-","SC / ST / PH ":" 0/-","All Category Female ":" 0/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years","Maximum Age ":" 27 Years.","Age Relaxation Extra as per DSSSB Senior Personal Assistant, Personal Assistant & Junior Judicial Assistant Post Recruitment Advt No. 01/2024 Vacancy Rules.":""},{"title":"CSIR CBRI Technical Assistant Online Form 2024","url":"https://www.sarkariresult.com/2024/csir-cbri-ta-jan24/","name of post":"csir central building research institute cbri technical assistant recruitment 2024 apply online for 24 post","post date / update":"13 january 2024 | 01:16 pm","short information ":"csir central building research institute cbri has relased technical assistant ta recruitment 2024. those candidates who are interested in this csir cbri ta recruitment can apply online from 10 january 2024 to 07 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 10/01/2024","Last Date for Apply Online ":" 07/02/2024 upto 05 PM","Pay Exam Fee Last Date  ":" 07/02/2024","Last Date Receipt Hard Copy ":" 20/02/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 100/-","SC / ST / PH ":" 0/-","All Category Female ":" 0/-","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking Only.":"","Minimum Age ":" NA","Maximum Age ":" 28 Years","Age Relaxation As per CSIR Central Building Research Institute Examination Recruitment Rules.":""},{"title":"RPSC Assistant Professor Online Form 2024","url":"https://www.sarkariresult.com/rpsc/rpsc-asst-prof-sanskrit-jan24/","name of post":"rajasthan rpsc assistant professor (sanskrit college education) recruitment 2024 apply online for 200 post","post date / update":"26 january 2024 | 11:54 am","short information ":"rajasthan public service commission (rpsc) has released the advertisement of assistant professor (sanskrit college education) recruitment 2024. those candidates are enrolled with vacancy can apply online from 22/01/2024 to 21/02/2024. for other information related to assistant professor sanskrit college education recruitment like syllabus, age limit, qualification, pay scale and all other information read the advertisement and then apply.","Application Begin ":" 22/01/2024","Last Date for Apply Online ":" 21/02/2024","Last Date Pay Exam Fee ":" 21/02/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / Other State ":" 600/-","OBC / BC ":" 400/-","SC / ST ":" 400/-","Correction Charge ":" 500/-","Candidates who have already paid the OTR fee will not have to pay the application fee.":"","Pay the Exam Fee Through Cash at Rajasthan E Mitra Portal or Through Debit Card, Credit Card, Net Banking":"","Minimum Age ":" 21 Years","Maximum Age ":" 40 Years","Age Relaxation Extra as per Rajasthan Public Service Commission Assistant Professor Recruitment Rules.":""},{"title":"Bihar Sachivalaya Reporter Online Form 2024","url":"https://www.sarkariresult.com/bihar/vidhan-parishad-reporter-01-2024/","name of post":"bihar legislative council vidhan parishad sachivalaya reporter (prativedak) recruitment 2024 apply online form","post date / update":"12 january 2024 | 11:49 am","short information ":"bihar legislative council vidhan parishad sachivalaya has released the advertisement for recruitment under reporter in which there are a total of 11 posts. both male and female candidates can apply online from 10 january 2024 to 30 january 2024. see the advertisement for information related to age limit, syllabus,selection procedure, pay scale in bihar vidhan parishad sachivalaya latest recruitment 2024.","Application Begin ":"  10/01/2024","Last Date for Apply Online ":" 30/01/2024","Pay Exam Fee Last Date ":" 30/01/2024","Exam Date":"  As per Schedule","Admit Card Available ":" Before Exam","General / OBC/ EWS / Other State ":" 1200/-","SC /  ST / PH ":" 600/-","Pay the Exam Fee Through Debit Card, Credit Card, Net Banking, E Challan Fee Mode Only.":"","Minimum Age ":" 21  Years","Maximum Age ":" 40 Years for Female","Age Relaxation Extra as per Bihar Vidhan Parishad Reporter (Prativedak) Recruitment Rules 2024.":""},{"title":"NWR RRC Jaipur Apprentices Online Form 2024","url":"https://www.sarkariresult.com/railway/nwr-rrc-jaipur-apprentices-jan24/","name of post":"indian railway nwr region rrc jaipur act apprentices notification 2024 apply online for 1646 post","post date / update":"08 january 2024 | 03:21 pm","short information ":"north western railway nwr railway recruitment cell rrc nwr jaipur region has released the detailed notification of act apprentices 1646 various posts whose advertisement 2024 . candidates who have placed in various act apprentices posts in rrc jaipur nwr region information of notification. interested eligible candidates can apply online from 10 january 2024 to 10 february 2024. in this railway jaipur recruitment 2024, read the advertisement of railway jaipur apprentices for eligibility, trade information, category wise post details, selection procedure, pay scale, training time and other information.","Application Begin ":" 10/01/2024","Last Date for Apply Online ":" 10/02/2024","Pay Exam Fee Last Date ":" 10/02/2024","Gen / OBC / EWS":" 100/-","SC / ST / PH ":" 0/-","All Category Female ":" 0/-","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking Only.":"","Minimum Age ":" 15 Years","Maximum Age ":" 24 Years","Age Relaxation Extra as per East Central Railway Recruitment Cell RRC North Western Railway NWR Jaipur Act Apprentice Rules 2023-24.":""},{"title":"UP Police Constable Sports Quota Online Form 2024","url":"https://www.sarkariresult.com/2023/up-police-constable-sports/","name of post":"uttar pradesh police upp constable sports quota 2023 apply online (extended) for 546 male / female post","post date / update":"08 january 2024 | 10:59 pm","short information ":"uttar pradesh police recruitment & promotion board (upprpb) has released the advertisement for recruitment under constable sports quota in which there are a total of 546 posts. both male and female candidates can apply for this recruitment, the last date of which is 15 january 2024. see the advertisement for information related to age limit, syllabus, sports wise post, selection procedure, pay scale in upp constable sports quota recruitment 2023.","Application Begin ":" 14/12/2023","Last Date for Apply Online ":" 01/01/2024","Last Date Pay Exam Fee ":" 01/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC ":" 400/-","SC / ST ":" 400/-","All Category Female ":" 400/-","Pay the Examination Fee Through Cast at E Challan or Debit Card, Credit Card, Net Banking":"","Minimum Age ":" 16 Years.","Maximum Age ":" 27 Years.","Age Relaxation Extra as per UP Police Constable Sports Quota Recruitment 2023 Rules.":""},{"title":"United India UIIC Administrative Officer Scale I Online Form 2024","url":"https://www.sarkariresult.com/bank/uiic-ao-jan24/","name of post":"united india insurance company limited uiic administrative officer scale i recruitment 2024 apply online for 250 post","post date / update":"10 january 2024 | 12:35 am","short information ":"united india insurance company limited uiichas released the advertisement for recruitment of administrative officer scale i 250 post which has been released in english languages. whoever is interested in uiic administrative officer scale i ao post recruitment 2024 and fulfills the eligibility can apply online between 08 january 2024 to 23 january 2024. uiic ao recruitment exam. for united india insurance administrative officer scale i post vacancy 2024 eligibility, jobs information, age limit, selection procedure, pay scale, job information and all other information, read the notification before applying.","Application Begin ":" 08/01/2024","Last Date for Apply Online ":" 23/01/2024","Last Date Pay Exam Fee ":" 23/01/2024","Exam Date  ":" February 2024","Admit Card Available ":" Before Exam  ","General / OBC / EWS  ":" 1000/-","SC / ST / PH ":" 250/-","GST Extra":"","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 21 Years.","Maximum Age ":" 30 Years.","Age Relaxation Extra as per United India Insurance Administrative Officer Scale I Exam 2024 Recruitment Rules.":""},{"title":"RPSC Vidhi Rachnakar Online Form 2024","url":"https://www.sarkariresult.com/rpsc/rpsc-vidhi-rachnakar-08-23/","name of post":"rajasthan public service commission rpsc vidhi rachnakar recruitment 2024 apply online for 09 post","post date / update":"06 january 2024 | 12:49 pm","short information ":"rajasthan public service commission (rpsc)has released the notification for recruitment to 09 posts of vidhi rachnakar exam 2024 . any candidate who is interested in this rajasthan rpsc vidhi rachanakar recruitment and fulfills the eligibility can apply online till 04 february 2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 05/01/2024","Last Date for Apply Online ":" 04/02/2024","Last Date Pay Exam Fee ":" 04/02/2024","Exam Date ":" as per Schedule","Admit Card Available ":" Notified Soon","General / Other State ":" 600/-","OBC / BC ":" 400/-","SC / ST ":" 400/-","Correction Charge ":" 500/-","Pay the Exam Fee Through Cash at Rajasthan E Mitra Portal or Through Debit Card, Credit Card, Net Banking":"","From 19 April 2023 onwards only one time fee will be charged for all the exams of Rajasthan":"","Minimum Age ":" 21 Years","Maximum Age ":" 40 Years","Age Relaxation Extra as per Rajasthan Public Service Commission Vidhi Rachnakar Exam 2024 Recruitment Rules.":""},{"title":"Navy B.Tech Entry July 2024 Online Form","url":"https://www.sarkariresult.com/force/navy-btech-july24/","name of post":"join indian navy 10+2 b.tech entry permanent commission july 2024 apply online for 35 post","post date / update":"05 january 2024 | 07:28 pm","short information ":"navy recruitment (join indian navy) has released the advertisement for recruitment to the post of executive & technical branch through 10+2 b.tech entry permanent commission july 2024 batch. all the candidates who want to apply for this navy recruitment can apply online from 06 january 2024 to 20 january 2024. see advertisement for other recruitment related information like syllabus, qualification, age limit, selection procedure.","Application Begin ":" 06/01/2024","Last Date for Apply Online ":" 20/01/2024","Last Date Send Application Form ":" No Need to Send Application Form","Merit List Issued ":" As per Schedule","All Candidates ":" 0/-","No Application Fee for the All Candidates Only Fill the Online Application Form.":"","Only Valid JEEMAIN 2023 Exam Score Card Candidates Are Apply Online":"","Born Between ":" 02/01/2005 to 01/07/2007"},{"title":"Indian Airforce Intake 01/2025 Online Form","url":"https://www.sarkariresult.com/force/airforce-intake-01-2025/","name of post":"indian airforce agniveer vayu intake 01/2025 exam online form 2024","post date / update":"17 january 2024 | 10:22 am","short information ":"join indian airforce has released the detailed notification of agniveer air intake 01/2025. all male and female candidates who are interested in this air force recruitment can apply online till 06 february 2024. for recruitment eligibility, age limit, post wise eligibility, selection procedure, syllabus and all other information read the advertisement and then apply.","Application Begin ":" 17/01/2024","Last Date for Apply Online ":" 06/02/2024","Pay Exam Fee Last Date ":" 06/02/2024","Exam Date ":" 17/03/2024","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 550/-","SC / ST ":"550/-","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking .":"","Minimum Age ":" 17.5 Years","Maximum Age ":" 21 Years","Age Between ":" 02/01/2004 to 02/07/2007","Age as per Indian Airforce Agniveers Vayu Intake 01/2025 Exam Rules.":""},{"title":"UPPSC Pre 2024 Online Form","url":"https://www.sarkariresult.com/2024/uppsc-pre-2024/","name of post":"uppsc up pre examination 2024 apply online form for 220 post","post date / update":"08 january 2024 | 03:25 pm","short information ":"uttar pradesh public service commission (uppsc) has issued an uttar pradesh combined state/upper subordinate services examination 2024 notification pre 2024. any candidate who is interested in this uttar pradesh uppsc pre recruitment 2024 can apply online from 01 january 2024 to 29 january 2024. for recruitment details, pay scale, age limit, selection prcedure, job information and all other information, read the advertisement and then apply.","Application Begin ":"01/01/2024","Last Date for Apply Online ":" 29/01/2024","Pay Exam Fee Last Date ":" 29/01/2024","Last Date Completed Form ":" 02/02/2024","Correction Last Date ":" 09/02/2024","Pre Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC ":" 125/-","SC / ST  ":" 65/-","PH Candidates ":" 25/-","Pay the Exam Fee Through SBI Mops Debit Card, Credit Card, Net Banking or SBI E Challan Mode Only":"","Minimum Age ":" 21 Years","Maximum Age ":" 40 Years","Age Relaxation Extra as per UPPSC Combined State / Upper Subordinate Exam 2024 Notification Rules":""},{"title":"UP Police Computer Operator / Programmer Online Form 2024","url":"https://www.sarkariresult.com/2024/up-police-computer-programmer/","name of post":"uttar pradesh up police computer operator and programmer recruitment 2023 apply online for 985 post","post date / update":"07 january 2024 | 10:46 am","short information ":"uttar pradesh police recruitment & promotion board (upprpb) has released the advertisement for recruitment under computer operator and programmer in which there are a total of 985 posts. both male and female candidates can apply online from 07 january 2024 to 28 january 2024. see the advertisement for information related to age limit, syllabus,selection procedure, pay scale in upp computer operator and programmer grade 2 up police recruitment 2023-2024.","Application Begin ":" 07/01/2024","Last Date for Apply Online ":" 28/01/2024","Last Date Pay Exam Fee ":" 28/01/2024","Correction Last Date ":" 30/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 400/-","SC / ST ":" 400/-","All Category Female ":" 400/-","Pay the Examination Fee Through Cast at E Challan or Debit Card, Credit Card, Net Banking":"","Computer Operator Post ":" 18-28 Years.","Programmer Grade II Post  ":" 21-30 Years.","Age Relaxation Extra as per UP Police PRPB Computer Operator & Programmer Grade II Recruitment 2023 Rules.":""},{"title":"DSSSB Section Officer Online Form 2024","url":"https://www.sarkariresult.com/delhi/dsssb-so-06-2023/","name of post":"delhi dsssb section officer horticulture recruitment 2023 apply online 108 post for under advt no. 06/2023","post date / update":"09 january 2024 | 11:05 am","short information ":"dsssb assistant teacher nursery online form 2024 delhi subordinate services selection board dsssb has released the advertisement for recruitment to 108 posts of section officer horticulture recruitment 2023 - 2024. any candidate who wants to apply for the post of dsssb section officer horticulture whose advertisement number is 06/2023 can apply online and pay the fee between 09 january 2024 to 07 february 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":" 09/01/2024","Last Date for Apply Online ":"07/02/2024","Last Date Pay Exam Fee ":" 07/02/2024","Exam Date ":" As per Schedule   ","Admit Card Available ":" Notified Soon ","General / OBC / EWS ":" 100/-","SC / ST / PH ":" 0/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 27-32 Years.","Age Relaxation Extra as per DSSSB Delhi Section Officer Horticulture Advt No. 06/2023 Recruitment Rules.":""},{"title":"National Insurance NICL AO Scale I Online Form 2024","url":"https://www.sarkariresult.com/bank/national-insurance-ao-jan24/","name of post":"national insurance nicl administrative officer ao recruitment 2024 apply online 274 various post","post date / update":"19 january 2024 | 01:34 am","short information ":"nicl ao scale i online form 2024 national insurance company limited (nicl) has released the advertisement for recruitment to 274 various administrative officer (ao) scale i exam 2024. any candidate who wants to apply for the post of nicl ao scale i recruitment 2024 can apply online and pay the fee between 02 january 2024 to 22 january 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":" 02/01/2024","Last Date for Apply Online ":" 22/01/2024","Pay Exam Fee Last Date ":" 22/01/2024","Phase I Exam Date ":" As per Schedule","Phase II Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 1000/-","SC / ST / PH ":" 250/-","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking / UPI Fee Mode Only.":"","Minimum Age ":" 21 Years","Maximum Age ":" 30 Years.","Age Relaxation Extra as per National Insurance Company Ltd (NICL) Administrative Officer AO Scale I Recruitment Rules 2023-2024.":""},{"title":"Bihar Vidhan Sabha Sachivalaya Various Post Online Form 2024","url":"https://www.sarkariresult.com/bihar/vidhan-sabha-advt-02-05-2023/","name of post":"bihar vidhan sabha sachivalaya driver, security guard, office attendant, data entry operator deo recruitment 2023 apply online form","post date / update":"03 january 2024 | 10:08 pm","short information ":"vidhan sabha sachivalaya bihar has released the advertisement for recruitment under driver, security guard, office attendant, data entry operator deo in which there are a total of (soon) posts. both male and female candidates can apply online from 01 january 2024 to 21 january 2024. see the advertisement for information related to age limit, syllabus,selection procedure, pay scale in bihar vidhan sabha latest recruitment 2023-2024.","Application Begin ":" 01/01/2024","Last Date for Apply Online ":" 21/01/2024","Pay Exam Fee Last Date ":" 23/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","For Security Guard Post ":"","General / OBC / EWS / Other State ":" 675/-","SC / ST ":" 150/-","For Driver, Office Attendant Post ":"","General / OBC / EWS ":" 600/-","For Data Entry Operator Post ":"","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking or Pay Offline Fee Payment Through E Challan Mode Only":"","For Security Guard ":" 18-25 Years as on 01/01/2024","For Driver & Office Attendant, DEO Post ":" 18-37 Years as on 01/08/2023","Age Relaxation Extra as per Bihar Vidhan Sabha Sachivalaya Various Post Advt No. 02-05/2023 Recruitment 2023.":""},{"title":"UP Police SI, ASI Online Form 2024","url":"https://www.sarkariresult.com/2024/up-police-si-asi-jan24/","name of post":"uttar pradesh up police sub inspector si confidential, assistant sub inspector asi clerk & accountant recruitment 2023 apply online for 921 post","post date / update":"07 january 2024 | 10:47 pm","short information ":"uttar pradesh police recruitment & promotion board (upprpb) has released the advertisement for recruitment under sub inspector si confidential, assistant sub inspector asi clerk & accountant in which there are a total of 921 posts. both male and female candidates can apply online from 07 january 2024 to 28 january 2024. see the advertisement for information related to age limit, syllabus,selection procedure, pay scale in upp si asi in civil police recruitment 2023-2024.","Application Begin ":" 07/01/2024","Last Date for Apply Online ":" 28/01/2024","Last Date Pay Exam Fee ":" 28/01/2024","Correction Last Date ":" 30/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 400/-","SC / ST ":" 400/-","All Category Female ":" 400/-","Pay the Examination Fee Through Cast at E Challan or Debit Card, Credit Card, Net Banking":"","Minimum Age ":" 21 Years.","Maximum Age ":" 28 Years.","Age Between ":" 01/07/1995 to 01/07/2002","Age Relaxation Extra as per UP Police PRPB Sub Inspector SI Confidential,  Assistant Sub Inspector ASI Clerk & Accountant Recruitment 2023 Rules.":""},{"title":"UPUMS Group B C Various Post Online Form 2024","url":"https://www.sarkariresult.com/2023/upums-advt34-dec23/","name of post":"upums etawah group b & c various post recruitment 2023 apply online 209 post","post date / update":"27 december 2023 | 07:25 pm","short information ":"upums group b & c online form 2024 uttar pradesh university of medical sciences upums etawah has released the advertisement for recruitment to 209 various group b & group c posts recruitment 2023 - 2024. any candidate who wants to apply for the post of upums various post whose advertisement number is 34/upums/recruitment cell/2023-24 (revised) can apply online and pay the fee between 22 december 2023 to 10 january 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":" 22/12/2023","Last Date for Apply Online ":" 10/01/2024","Pay Exam Fee Last Date ":" 10/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 2360/-","SC / ST ":" 1416/-","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years","Maximum Age ":" 40 Years.","Age Relaxation Extra as per Uttar Pradesh University of Medical Sciences Various Post Recruitment Rules.":""},{"title":"DSSSB PGT Teacher Online Form 2024","url":"https://www.sarkariresult.com/delhi/dsssb-pgt-07-2023/","name of post":"delhi dsssb post graduate teacher recruitment 2023 apply online 297 post for under advt no. 07/2023","post date / update":"09 january 2024 | 11:06 am","short information ":"dsssb assistant teacher nursery online form 2024 delhi subordinate services selection board dsssb has released the advertisement for recruitment to 297 posts of post graduate teachers in various subjects recruitment 2023 - 2024. any candidate who wants to apply for the post of dsssb pgt teachers whose advertisement number is 07/2023 can apply online and pay the fee between 09 january 2024 to 07 february 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":" 09/01/2024","Last Date for Apply Online ":" 07/02/2024","Pay Exam Fee Last Date":" 07/02/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam  ","General / OBC ":" 100/-","SC / ST / PH ":" 0/-","All Category Female ":" 0/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" NA","Maximum Age ":" 36 Years.","Age Relaxation Extra as per DSSSB PGT Teacher Notification.":""},{"title":"BHU Nursing Officer, Other Post Online Form 2024","url":"https://www.sarkariresult.com/2023/bhu-nursing-officer-dec23/","name of post":"banaras hindu university bhu nursing officer, medical officer, non teaching recruitment 2023 apply online 247 post","post date / update":"25 december 2023 | 07:37 pm","short information ":"bhu non teaching post online form 2024 banaras hindu university has released the advertisement no. 20/2023-2024 (non-teaching posts under group 'a' & 'b') . any candidate who is eligible for these nursing officer, medical officer and other non teaching posts and fulfills the eligibility can apply online till 22 january 2024. read the advertisement for subject wise recruitment information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 22/12/2023","Last Date for Apply Online ":" 22/01/2024","Pay Exam Fee Last Date":" 22/01/2024","Submit Form Hard Copy ":" 28/01/2024","Exam Date ":" As per Schedule    ","Admit Card Available ":" Before Exam ","For Nursing Officer Post ":"","General / OBC / EWS ":" 1000/-","SC / ST ":" 0/-","All Category Female ":" 0/-","For Other Post ":"","Pay the Exam Fee Through Debit Card / Credit Card / Net Banking / UPI Fee Mode Only.":"","Minimum Age ":" NA","Maximum Age ":" 30-50 Years (Post Wise)","For Age Relaxation Details Must Read the Banaras Hindu University Group  BHU Group A &  B Various Post Notification 2023.":""},{"title":"DSSSB LDC, Stenographer, Junior Assistant, Other Post Online Form 2024","url":"https://www.sarkariresult.com/delhi/dsssb-various-05-2023/","name of post":"delhi dsssb junior assistant, lower division clerk ldc, assistant grade i, stenographer recruitment 2023 apply online 2354 post for under advt no. 05/2023","post date / update":"09 january 2024 | 11:06 pm","short information ":"dsssb assistant teacher nursery online form 2024 delhi subordinate services selection board dsssb has released the advertisement for recruitment to 2354 posts of junior assistant, lower division clerk ldc, assistant grade i, stenographer recruitment 2023 - 2024. any candidate who wants to apply for the post of dsssb junior assistant, ldc, assistant grade i, stenographer whose advertisement number is 05/2023 can apply online and pay the fee between 09 january 2024 to 07 february 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":" 09/01/2024","Last Date for Apply Online ":"07/02/2024","Last Date Pay Exam Fee ":" 07/02/2024","Exam Date ":" As per Schedule   ","Admit Card Available ":" Notified Soon ","General / OBC / EWS ":" 100/-","SC / ST / PH ":" 0/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years","Maximum Age ":" 27-30 Years (Post Wise)","Age Relaxation Extra as per DSSSB Delhi LDC, Junior Assistant, Steno & Other Post Advt No. 05/2023 Recruitment Rules.":""},{"title":"Delhi DSSSB Assistant Teacher Nursery Online Form 2024","url":"https://www.sarkariresult.com/delhi/dsssb-asst-teacher-08-2023/","name of post":"delhi dsssb assistant teacher (nursery) recruitment 2023 apply online 1455 post for under advt no. 08/2023","post date / update":"09 january 2024 | 11:04 am","short information ":"dsssb assistant teacher nursery online form 2024 delhi subordinate services selection board dsssb has released the advertisement for recruitment to 1455 posts of assistant teacher nursery recruitment 2023 - 2024. any candidate who wants to apply for the post of dsssb assistant teacher nursery whose advertisement number is 08/2023 can apply online and pay the fee between 09 january 2024 to 07 february 2024. apply only after reading the advertisement for recruitment eligibility, age limit, selection procedure, syllabus, pay scale and other information.","Application Begin ":" 09/01/2024","Last Date for Apply Online ":"07/02/2024","Last Date Pay Exam Fee ":" 07/02/2024","Exam Date ":" As per Schedule   ","Admit Card Available ":" Notified Soon ","General / OBC / EWS ":" 100/-","SC / ST / PH ":" 0/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking Fee Mode Only.":"","Minimum Age ":" NA","Maximum Age ":" 30 Years.","Age Relaxation Extra as per DSSSB Delhi Assistant Teacher Nursery Advt No. 08/2023 Recruitment Rules.":""},{"title":"UP Police Constable 60244 Post Online Form 2023","url":"https://www.sarkariresult.com/2023/up-police-constable-dec23/","name of post":"uttar pradesh up police constable recruitment 2023 apply online for 60244 male / female post 2024","post date / update":"17 january 2024 | 10:17 am","short information ":"uttar pradesh police recruitment & promotion board (upprpb) has released the advertisement for recruitment under constable in which there are a total of 60244 posts. both male and female candidates can apply online from 27 december 2023 to 16 january 2024. see the advertisement for information related to age limit, syllabus, age relaxation, selection procedure, pay scale in upp constable civil police recruitment 2023.","Notification Released ":" 23/12/2023","Application Begin ":" 27/12/2023","Last Date for Apply Online ":" 16/01/2024","Pay Exam Fee Last Date ":" 16/01/2024","Upload Document / Correction Last Date ":" 17-20 January 2024","Exam Date ":" February 2024","Admit Card Available ":" Before Exam","General / OBC ":" 400/-","SC / ST ":" 400/-","Pay the Exam Fee Through Online Fee Mode Debit Card, Credit Card, Net Banking or Offline E Challan Mode":"","Minimum Age ":" 18 Years","Maximum Age ":" 28 Years for Female","Age Relaxation Extra as per UPP Constable Recruitment 2023 Rules.":""},{"title":"General Insurance GIC Scale I Online Form 2023","url":"https://www.sarkariresult.com/bank/gic-scale-i-dec23/","name of post":"general insurance corporation of india scale i recruitment 2023 apply online for 85 various post","post date / update":"23 december 2023 | 01:58 pm","short information ":"general insurance corporation of india gic scale i online form 2023 : general insurance corporation of india has issued an various scale i post notification 2023. any candidate who is interested in this gic scale i recruitment exam 2023 vacancy recruitment 2023 can apply online from 23 december 2023 to 12 january 2024. for recruitment details, pay scale, age limit, selection prcedure, job information and all other information, read the advertisement and then apply.","Application Begin ":" 23/12/2023","Last Date for Apply Online ":" 12/01/2024","Pay Exam Fee Last Date":" 12/01/2024","Exam Date ":" February 2024   ","Admit Card Available ":" Before Exam","General / OBC ":" 1000/-","SC / ST / PH ":" 0/-","All Category Female ":" 0/-","Pay the Examination Fee Through Debit Card / Credit Card / Net Banking / E Wallet / Cash Card / IMPS / UPI Fee Mode Only.":"","Minimum Age ":" 21 Years.","Maximum Age ":" 30 Years.","Age Between ":" 22/08/1989 to 21/08/1998","Age Relaxation Extra as per General Insurance Corporation of India Scale I Recruitment Rules.":""},{"title":"IB ACIO II / Technical Online Form 2023","url":"https://www.sarkariresult.com/2023/ib-acio-technical-dec23/","name of post":"mha intelligence bureau ib assistant central intelligence officer grade ii / technical recruitment 2023 apply online for 995 acio ii / exe post","post date / update":"23 december 2023 | 01:08 pm","short information ":"ib acio ii / technical post online form 2023 : ministry of home affairs mha | intelligence bureau ib has issued an assistant central intelligence officer grade ii / technical post through gate notification 2023. any candidate who is interested in this ib acio ii / technical exam 2023 vacancy recruitment 2023 can apply online from 23 december 2023 to 12 january 2024. for recruitment details, pay scale, age limit, selection prcedure, job information and all other information, read the advertisement and then apply.","Application Begin ":" 23/12/2023","Last Date for Apply Online ":"12/01/2024","Pay Exam Fee Last Date ":" 12/01/2024","Offline Payment E Challan ":" 16/01/2024","Exam Date / Interview ":" As per Schedule","General / OBC / EWS ":" 200/-","SC / ST / OH ":" 100/-","All Category Female ":" 100/-","Pay the Exam Fees Through Debit Card / Credit Card / Net Banking / E Challan Mode Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 27 Years.","Age Relaxation Extra as per MHA IB ACIO II / Tech. Recruitment Exam 2023-2024 Rules.":""},{"title":"Allahabad High Court UP HJS Online Form 2024","url":"https://www.sarkariresult.com/2023/allahabad-hc-hjs-2023/","name of post":"allahabad high court district judge up hjs recruitment 2023-24 apply online for 83 post","post date / update":"15 january 2024 | 11:58 am","short information ":"high court of judicature at allahabad, uttar pradesh has released the notification of district judge recruitment 2023. many people also know this recruitment by the name of up hjs. this year there are a total of 83 posts in uttar pradesh allahabad high court hjs recruitment for which online applications will run from 15 february 2024 to 31 march 2024. see the advertisement for information related to age limit, syllabus, selection procedure, pay scale in up hjs exam 2024.","Application Begin ":" 15/02/2024","Last Date for Apply Online ":" 31/03/2024","Last Date Pay Exam Fee ":"  31/03/2024","Submit Hard Copy Last Date ":" As per Schedule","Pre Exam Held on ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 1400/-","SC / ST ":" 1200/-","PH Divyang Gen / OBC / EWS ":" 750/-","PH Divyang SC / ST  ":" 500/-","Pay the Exam Fee Through Offline E Challan Fee Mode Only. Candidate Can Print Challan and Submit Fee Before Apply Online.":"","Minimum Age ":" 35 Years.","Maximum Age ":" 45 Years.","Age Relaxation Extra as per High Court of Judicature at Allahabad Higher Judicial Services Exam 2023-2024 Rules.":""},{"title":"Central Bank of India Safai Karamchari Online Form 2023","url":"https://www.sarkariresult.com/bank/central-bank-safai-dec23/","name of post":"central bank of india cbi safai karamchari & sub staff recruitment 2023 apply online for 484 post","post date / update":"21 december 2023 | 02:08 pm","short information ":"central bank of india has released the advertisement for recruitment under safai karamchari & sub staff in which there are a total of 484 posts. both male and female candidates can apply for this recruitment, the last date of which is 09 january 2024. see the advertisement for information related to age limit, syllabus, district / state wise post, selection procedure, pay scale in central bank of india cbi safai karamchari / sub staff recruitment exam 2023 - 2024.","Application Begin ":" 20/12/2023","Last Date for Apply Online ":" 09/01/2024","Pay Examination Fee Last Date ":" 09/01/2024","Exam Date  ":" February 2024","Admit Card Available ":" Before Exam  ","General / OBC/ EWS ":" 850/-","SC / ST ":" 175/-","Payment Mode - Pay the Examination Fee Through Debit Card / Credit Card / Net Banking Fee Mode Only.":"","Minimum Age ":" 18 Years.","Maximum Age ":" 26 Years.","Age Relaxation Extra as per Central Bank of India Safai Karmachari / Sub Staff Recruitment 2023-2024 Rules":""},{"title":"UP Police Sub Inspector (Sports Quota) Online Form 2023","url":"https://www.sarkariresult.com/2023/up-police-si-sports-dec23/","name of post":"uttar pradesh police upp sub inspector daroga sports quota 2023 apply online for 91 male / female post","post date / update":"15 january 2024 | 12:33 pm","short information ":"uttar pradesh police recruitment & promotion board (upprpb) has released the advertisement for recruitment under sub inspector si (daroga) sports quota in which there are a total of 91 posts. both male and female candidates can apply for this recruitment, the last date of which is 24 january 2024. see the advertisement for information related to age limit, syllabus, sports wise post, selection procedure, pay scale in upp direct recruitment of skilled players to the posts of sub inspector civil police in uttar pradesh police 2023 exam 2023.","Application Begin ":" 20/12/2023","Last Date for Apply ":" 24/01/2024","Last Date Pay Exam Fee ":" 24/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC ":" 400/-","SC / ST ":" 400/-","All Category Female ":" 400/-","Pay the Examination Fee Through Cast at E Challan or Debit Card, Credit Card, Net Banking":"","Minimum Age ":" 16 Years.","Maximum Age ":" 32 Years.","Age Relaxation Extra as per UP Police Sub Inspector Sports Quota Recruitment 2023 Rules.":""},{"title":"UPPSC Technical Education Service Exam Online Form 2023","url":"https://www.sarkariresult.com/2023/uppsc-tech-education-dec23/","name of post":"uppsc up uttar pradesh technical education (teaching/training) examination 2023 apply online for 45 post","post date / update":"21 december 2023 | 10:21 am","short information ":"uttar pradesh public service commission (uppsc) has issued an uttar pradesh technical education (teaching/training) service examination 2023 notification 2023-2024. any candidate who is interested in this uppsc uttar pradesh technical education (teaching/training)vacancy recruitment 2023 can apply online from 21 december 2023 to 18 january 2024. for recruitment details, pay scale, age limit, selection prcedure, job information and all other information, read the advertisement and then apply.","Application Begin ":" 21/12/2023","Last Date for Apply Online ":" 18/01/2024","Pay Exam Fee Last Date ":" 18/01/2024","Correction Last Date ":" 22/01/2024","Exam Date ":" As per Schedule","Admit Card Available ":" Before Exam","General / OBC / EWS ":" 225/-","SC / ST ":" 105/-","PH Candidates ":" 25/-","Pay the Examination Fee Through Debit Card, Credit Card, Net Banking or Pay Offline Through E Challan":"","Minimum Age ":" 21 Years","Maximum Age":" 40 Years","Age Relaxation Extra as per UPPSC Uttar Pradesh Technical Education (Teaching/Training) Service Examination Rules 2023.":""},{"title":"UPSC CDS First Online Form 2024","url":"https://www.sarkariresult.com/upsc/upsc-cds-first-2024/","name of post":"upsc combined defence services cds first examination 2024 apply online for 457 post","post date / update":"20 december 2023 | 12:32 pm","short information ":"union public service commission upsc has released the combined defence services cds first examination 2024. those candidate are interested to upsc cds i 2024 exam can apply online from 20/12/2023 to 09/01/2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other combined defence services cds exam related information.","Application Begin ":" 20/12/2023","Last Date of Apply Online ":"","Fee Payment Last Date ":" 09/01/2024","Modify / Edit Form ":" 10-16 January 2024","Exam Date ":" 21/04/2024","Admit Card Available ":" Before Exam","Result Declared ":" Notified Soon","General / OBC ":" 200/-","SC / ST / Female ":" 0/- (Exempted)","Pay the Examination Fee Through Challan or Net Banking, Debit Card, Credit Card Fee Mode.":""},{"title":"UPSC NDA First Online Form 2024","url":"https://www.sarkariresult.com/upsc/upsc-nda-first-2024/","name of post":"upsc national decence academy nda and naval academy na examination 2024 apply online for 400 post","post date / update":"20 december 2023 | 12:08 pm","short information ":"union public service commission upsc has released the national defence academy nda (male / female), naval academy na only for male, nda & na first examination 2024. those candidate are interested to upsc nda & na 2024 exam can apply online from 20/12/2023 to 09/01/2024. read the notification for recruitment eligibility, post information, selection procedure, age limit, pay scale and all other information.","Application Begin ":" 20/12/2023","Last Date for Apply Online ":"","Pay Exam Fee Last Date ":" 09/01/2024","Modify / Edit Form ":" 10-16 January 2024","NDA I Exam Date ":" 21/04/2024","Admit Card Released ":" Before Exam","General / OBC ":" 100/-","SC / ST ":" 0/- (Nil)","All Category Female ":" 0/-","Pay the Examination Fee Through Net Banking, Debit Card, Credit Card or Pay the Exam Fee Through Cash E Challan Fee Mode Submit the Exam Fee at State Bank of India SBI Any Branches in India.":"","Age Between":" 02/07/2005 to 01/07/2008","Age Relaxation Extra as per NDA I Exam 2024 Rules.":""}]